# Taps
tap "cloudflare/cloudflare"
tap "elastic/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "shopify/shopify"
tap "snyk/tap"
tap "withgraphite/tap"

# Essential CLI tools
brew "bat"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "jq"
brew "ripgrep"
brew "tig"
brew "zoxide"

# Development tools
brew "autoconf"
brew "automake"
brew "biome"
brew "coreutils"
brew "libtool"
brew "pkgconf"

# Languages & runtimes
brew "node"
brew "nvm"
brew "python@3.13"
brew "ruby@3.0"
brew "openjdk@17"

# Databases
brew "postgresql@17", link: true
brew "pgvector"
brew "redis"

# Image/media processing
brew "imagemagick"
brew "vips"

# Cloud/deployment
brew "flyctl"
brew "render"
brew "cloudflared"
brew "heroku/brew/heroku"

# Security & infrastructure
brew "gnupg"
brew "hashicorp/tap/vault"
brew "semgrep"
brew "snyk/tap/snyk"

# Git utilities
brew "git-filter-repo"

# Database tools
brew "goose"

# AI/API tools
brew "gemini-cli"

# Build tools
brew "xcodegen"

# Package managers
brew "yarn"
brew "oven-sh/bun/bun"

# Graphite
brew "withgraphite/tap/graphite"

# Miscellaneous
brew "telnet"

# Casks
cask "chromedriver"
cask "ngrok"

# VSCode/Cursor extensions
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "detachhead.basedpyright"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "karunamurti.haml"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "openai.chatgpt"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rubocop.vscode-rubocop"
vscode "rust-lang.rust-analyzer"
vscode "shopify.theme-check-vscode"
vscode "sissel.shopify-liquid"
vscode "tamasfe.even-better-toml"

# Go packages
go "github.com/bootdotdev/bootdev"
